#### Terraform Validation & Plan Results
* Terraform Version 📎`1.6.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mazurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001][0m
[0m[1mazurerm_data_factory.data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dpml-nsg001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dpml-rt001][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001][0m
[0m[1mazurerm_role_assignment.current_role_assignment_key_vault_administrator: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001/providers/Microsoft.Authorization/roleAssignments/912502bc-7e19-3eb7-6aae-bddb7ad6a5ae][0m
[0m[1mazurerm_data_factory_integration_runtime_self_hosted.data_factory_integration_runtime_self_hosted: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001/integrationruntimes/SelfhostedIntegrationRuntime001][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/DefaultResourceGroup-NEU/providers/Microsoft.OperationalInsights/workspaces/DefaultWorkspace-8f171ff9-2b5b-4f0f-aed5-7fa360a1d094-NEU][0m
[0m[1mazurerm_key_vault_secret.key_vault_secret_shir_key: Refreshing state... [id=https://shir-dev-kv001.vault.azure.net/secrets/datafactory-shir-auth-key/3ee21ff4bcb74a1cad04bb3e4ae02e1f][0m

[1m[36mNote:[0m[1m Objects have changed outside of Terraform
[0m
Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # azurerm_data_factory_integration_runtime_self_hosted.data_factory_integration_runtime_self_hosted[0m has been deleted
[0m  [31m-[0m[0m resource "azurerm_data_factory_integration_runtime_self_hosted" "data_factory_integration_runtime_self_hosted" {
        id                                           = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001/integrationruntimes/SelfhostedIntegrationRuntime001"
        name                                         = "SelfhostedIntegrationRuntime001"
      [31m-[0m[0m primary_authorization_key                    = "IR@8d912dc6-9c2e-49c5-a696-80eccaa12cee@shir-dev-adf001@ServiceEndpoint=shir-dev-adf001.northeurope.datafactory.azure.net@m9q1yq1ugkXsQu+rNSp0yp4hkXxTn3jRmtwYuDJOY9k=" [90m-> null[0m[0m
        [90m# (4 unchanged attributes hidden)[0m[0m
    }

[1m  # azurerm_key_vault.key_vault[0m has been deleted
[0m  [31m-[0m[0m resource "azurerm_key_vault" "key_vault" {
      [31m-[0m[0m id                              = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001" [90m-> null[0m[0m
      [31m-[0m[0m name                            = "shir-dev-kv001" [90m-> null[0m[0m
      [31m-[0m[0m resource_group_name             = "shir-dev-shir-rg" [90m-> null[0m[0m
        tags                            = {
            "workload" = "shir-runners"
        }
        [90m# (12 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_data_factory[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_data_factory" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001"
    }

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_service_plan" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_windows_web_app[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_windows_web_app" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # azapi_resource.subnet_container[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "subnet_container" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m addressPrefix                     = "10.0.96.64/26"
                  [32m+[0m[0m delegations                       = [
                      [32m+[0m[0m {
                          [32m+[0m[0m name       = "ContainerDelegation"
                          [32m+[0m[0m properties = {
                              [32m+[0m[0m serviceName = "Microsoft.Web/serverfarms"
                            }
                        },
                    ]
                  [32m+[0m[0m ipAllocations                     = []
                  [32m+[0m[0m networkSecurityGroup              = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dpml-nsg001"
                    }
                  [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
                  [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
                  [32m+[0m[0m routeTable                        = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dpml-rt001"
                    }
                  [32m+[0m[0m serviceEndpointPolicies           = []
                  [32m+[0m[0m serviceEndpoints                  = []
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "ContainerSubnet"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # azapi_resource.subnet_private_endpoints[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "subnet_private_endpoints" {
      [32m+[0m[0m body                      = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m addressPrefix                     = "10.0.96.128/27"
                  [32m+[0m[0m delegations                       = []
                  [32m+[0m[0m ipAllocations                     = []
                  [32m+[0m[0m networkSecurityGroup              = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dpml-nsg001"
                    }
                  [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
                  [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
                  [32m+[0m[0m routeTable                        = {
                      [32m+[0m[0m id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dpml-rt001"
                    }
                  [32m+[0m[0m serviceEndpointPolicies           = []
                  [32m+[0m[0m serviceEndpoints                  = []
                }
            }
        )
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = (known after apply)
      [32m+[0m[0m name                      = "PrivateEndpointSubnet"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = (known after apply)
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # azurerm_data_factory.data_factory[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_data_factory" "data_factory" {
        id                              = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001"
        name                            = "shir-dev-adf001"
      [33m~[0m[0m public_network_enabled          = true [33m->[0m[0m false
      [33m~[0m[0m tags                            = {
          [32m+[0m[0m "workload" = "shir-runners"
        }
        [90m# (3 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # azurerm_data_factory_integration_runtime_self_hosted.data_factory_integration_runtime_self_hosted[0m will be created
[0m  [32m+[0m[0m resource "azurerm_data_factory_integration_runtime_self_hosted" "data_factory_integration_runtime_self_hosted" {
      [32m+[0m[0m data_factory_id             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001"
      [32m+[0m[0m description                 = "Self-Hosted Integration Runtime 001"
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m name                        = "SelfhostedIntegrationRuntime001"
      [32m+[0m[0m primary_authorization_key   = (known after apply)
      [32m+[0m[0m secondary_authorization_key = (known after apply)
    }

[1m  # azurerm_key_vault.key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [32m+[0m[0m access_policy                   = []
      [32m+[0m[0m enable_rbac_authorization       = true
      [32m+[0m[0m enabled_for_deployment          = false
      [32m+[0m[0m enabled_for_disk_encryption     = false
      [32m+[0m[0m enabled_for_template_deployment = false
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m location                        = "northeurope"
      [32m+[0m[0m name                            = "shir-dev-kv001"
      [32m+[0m[0m public_network_access_enabled   = false
      [32m+[0m[0m purge_protection_enabled        = true
      [32m+[0m[0m resource_group_name             = "shir-dev-shir-rg"
      [32m+[0m[0m sku_name                        = "premium"
      [32m+[0m[0m soft_delete_retention_days      = 7
      [32m+[0m[0m tags                            = {
          [32m+[0m[0m "workload" = "shir-runners"
        }
      [32m+[0m[0m tenant_id                       = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e"
      [32m+[0m[0m vault_uri                       = (known after apply)

      [32m+[0m[0m network_acls {
          [32m+[0m[0m bypass         = "AzureServices"
          [32m+[0m[0m default_action = "Deny"
        }
    }

[1m  # azurerm_key_vault_secret.key_vault_secret_shir_key[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_shir_key" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = (known after apply)
      [32m+[0m[0m name                    = "datafactory-shir-auth-key"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_data_factory[0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_data_factory" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/DefaultResourceGroup-NEU/providers/Microsoft.OperationalInsights/workspaces/DefaultWorkspace-8f171ff9-2b5b-4f0f-aed5-7fa360a1d094-NEU"
      [32m+[0m[0m name                           = "logAnalytics"
      [32m+[0m[0m target_resource_id             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001"
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_key_vault" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/DefaultResourceGroup-NEU/providers/Microsoft.OperationalInsights/workspaces/DefaultWorkspace-8f171ff9-2b5b-4f0f-aed5-7fa360a1d094-NEU"
      [32m+[0m[0m name                           = "logAnalytics"
      [32m+[0m[0m target_resource_id             = (known after apply)
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan[0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_service_plan" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/DefaultResourceGroup-NEU/providers/Microsoft.OperationalInsights/workspaces/DefaultWorkspace-8f171ff9-2b5b-4f0f-aed5-7fa360a1d094-NEU"
      [32m+[0m[0m name                           = "logAnalytics"
      [32m+[0m[0m target_resource_id             = (known after apply)
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_windows_web_app[0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_windows_web_app" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/DefaultResourceGroup-NEU/providers/Microsoft.OperationalInsights/workspaces/DefaultWorkspace-8f171ff9-2b5b-4f0f-aed5-7fa360a1d094-NEU"
      [32m+[0m[0m name                           = "logAnalytics"
      [32m+[0m[0m target_resource_id             = (known after apply)
    }

[1m  # azurerm_private_endpoint.data_factory_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "data_factory_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "shir-dev-adf001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "shir-dev-adf001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "shir-dev-shir-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "shir-runners"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "shir-dev-adf001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.datafactory.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "shir-dev-adf001-pe"
          [32m+[0m[0m private_connection_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001"
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "dataFactory",
            ]
        }
    }

[1m  # azurerm_private_endpoint.key_vault_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "key_vault_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "shir-dev-kv001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "shir-dev-kv001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "shir-dev-shir-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "shir-runners"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "shir-dev-kv001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "shir-dev-kv001-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "vault",
            ]
        }
    }

[1m  # azurerm_private_endpoint.windows_web_app_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "windows_web_app_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "shir-dev-asp001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "shir-dev-asp001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "shir-dev-shir-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "shir-runners"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "shir-dev-asp001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "shir-dev-asp001-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "sites",
            ]
        }
    }

[1m  # azurerm_role_assignment.current_role_assignment_key_vault_administrator[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_role_assignment_key_vault_administrator" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Administrator"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.uai_role_assignment_key_vault_secrets_user[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "uai_role_assignment_key_vault_secrets_user" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets User"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_service_plan.service_plan[0m will be created
[0m  [32m+[0m[0m resource "azurerm_service_plan" "service_plan" {
      [32m+[0m[0m id                           = (known after apply)
      [32m+[0m[0m kind                         = (known after apply)
      [32m+[0m[0m location                     = "northeurope"
      [32m+[0m[0m maximum_elastic_worker_count = (known after apply)
      [32m+[0m[0m name                         = "shir-dev-asp001"
      [32m+[0m[0m os_type                      = "WindowsContainer"
      [32m+[0m[0m per_site_scaling_enabled     = false
      [32m+[0m[0m reserved                     = (known after apply)
      [32m+[0m[0m resource_group_name          = "shir-dev-shir-rg"
      [32m+[0m[0m sku_name                     = "P1mv3"
      [32m+[0m[0m tags                         = {
          [32m+[0m[0m "workload" = "shir-runners"
        }
      [32m+[0m[0m worker_count                 = 1
      [32m+[0m[0m zone_balancing_enabled       = false
    }

[1m  # azurerm_user_assigned_identity.user_assigned_identity[0m will be created
[0m  [32m+[0m[0m resource "azurerm_user_assigned_identity" "user_assigned_identity" {
      [32m+[0m[0m client_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "shir-dev-uai001"
      [32m+[0m[0m principal_id        = (known after apply)
      [32m+[0m[0m resource_group_name = "shir-dev-shir-rg"
      [32m+[0m[0m tags                = {
          [32m+[0m[0m "workload" = "shir-runners"
        }
      [32m+[0m[0m tenant_id           = (known after apply)
    }

[1m  # azurerm_windows_web_app.windows_web_app[0m will be created
[0m  [32m+[0m[0m resource "azurerm_windows_web_app" "windows_web_app" {
      [32m+[0m[0m app_settings                                   = (known after apply)
      [32m+[0m[0m client_affinity_enabled                        = false
      [32m+[0m[0m client_certificate_enabled                     = false
      [32m+[0m[0m client_certificate_mode                        = "Required"
      [32m+[0m[0m custom_domain_verification_id                  = (sensitive value)
      [32m+[0m[0m default_hostname                               = (known after apply)
      [32m+[0m[0m enabled                                        = true
      [32m+[0m[0m ftp_publish_basic_authentication_enabled       = false
      [32m+[0m[0m hosting_environment_id                         = (known after apply)
      [32m+[0m[0m https_only                                     = true
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m key_vault_reference_identity_id                = (known after apply)
      [32m+[0m[0m kind                                           = (known after apply)
      [32m+[0m[0m location                                       = "northeurope"
      [32m+[0m[0m name                                           = "shir-dev-asp001"
      [32m+[0m[0m outbound_ip_address_list                       = (known after apply)
      [32m+[0m[0m outbound_ip_addresses                          = (known after apply)
      [32m+[0m[0m possible_outbound_ip_address_list              = (known after apply)
      [32m+[0m[0m possible_outbound_ip_addresses                 = (known after apply)
      [32m+[0m[0m public_network_access_enabled                  = false
      [32m+[0m[0m resource_group_name                            = "shir-dev-shir-rg"
      [32m+[0m[0m service_plan_id                                = (known after apply)
      [32m+[0m[0m site_credential                                = (sensitive value)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "workload" = "shir-runners"
        }
      [32m+[0m[0m virtual_network_subnet_id                      = (known after apply)
      [32m+[0m[0m webdeploy_publish_basic_authentication_enabled = false
      [32m+[0m[0m zip_deploy_file                                = (known after apply)

      [32m+[0m[0m identity {
          [32m+[0m[0m identity_ids = (known after apply)
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned, UserAssigned"
        }

      [32m+[0m[0m site_config {
          [32m+[0m[0m always_on                                     = true
          [32m+[0m[0m auto_heal_enabled                             = false
          [32m+[0m[0m container_registry_managed_identity_client_id = (known after apply)
          [32m+[0m[0m container_registry_use_managed_identity       = true
          [32m+[0m[0m default_documents                             = (known after apply)
          [32m+[0m[0m detailed_error_logging_enabled                = (known after apply)
          [32m+[0m[0m ftps_state                                    = "Disabled"
          [32m+[0m[0m health_check_eviction_time_in_min             = (known after apply)
          [32m+[0m[0m http2_enabled                                 = true
          [32m+[0m[0m ip_restriction_default_action                 = "Allow"
          [32m+[0m[0m linux_fx_version                              = (known after apply)
          [32m+[0m[0m load_balancing_mode                           = "LeastRequests"
          [32m+[0m[0m local_mysql_enabled                           = false
          [32m+[0m[0m managed_pipeline_mode                         = "Integrated"
          [32m+[0m[0m minimum_tls_version                           = "1.2"
          [32m+[0m[0m remote_debugging_enabled                      = false
          [32m+[0m[0m remote_debugging_version                      = "VS2022"
          [32m+[0m[0m scm_ip_restriction_default_action             = "Allow"
          [32m+[0m[0m scm_minimum_tls_version                       = "1.2"
          [32m+[0m[0m scm_type                                      = (known after apply)
          [32m+[0m[0m scm_use_main_ip_restriction                   = false
          [32m+[0m[0m use_32_bit_worker                             = true
          [32m+[0m[0m vnet_route_all_enabled                        = true
          [32m+[0m[0m websockets_enabled                            = false
          [32m+[0m[0m windows_fx_version                            = (known after apply)
          [32m+[0m[0m worker_count                                  = (known after apply)

          [32m+[0m[0m application_stack {
              [32m+[0m[0m current_stack                = (known after apply)
              [32m+[0m[0m docker_image_name            = (sensitive value)
              [32m+[0m[0m docker_registry_password     = (sensitive value)
              [32m+[0m[0m docker_registry_url          = (sensitive value)
              [32m+[0m[0m docker_registry_username     = (known after apply)
              [32m+[0m[0m dotnet_version               = (known after apply)
              [32m+[0m[0m java_embedded_server_enabled = (known after apply)
              [32m+[0m[0m php_version                  = (known after apply)
              [32m+[0m[0m python                       = false
              [32m+[0m[0m python_version               = (known after apply)
            }
        }
    }

[1mPlan:[0m 17 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>